using System.Collections;
using System.Collections.Generic;
using UnityEngine;

//александр
/// <summary>
/// редактор уровней (наследует все от LevelsScript)
/// </summary>
public class LevelsArray : LevelsScript
{
    private void Start()
    {
        main = this;

        ////////////////////////////////////////////////////////////////////////////
        //уровень 1
        int lvl = 1;
        Levels[lvl] = CreateLevel(1, 6, 5, 15000, 15, 3, 0);

        Levels[lvl].PassedWithCrystal = true;
        Levels[lvl].NeedColor = (CellInternalObject.InternalColor)0;
        Levels[lvl].NeedCrystal = 20;
        Debug.Log((int)Levels[1].NeedColor);
        Levels[lvl].SetMass(
        new int[,] //exist
            {
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 }
            },
            "exist"
            );
        Levels[lvl].SetMass(
            new int[,] //color
            {
                { 3,0,3,0,1 },
                { 0,3,1,1,0 },
                { 0,3,3,1,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 }
            },
            "color"
            );
        Levels[lvl].SetMass(
            new int[,] //type
            {
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 }
            },
            "type"
            );
        Levels[lvl].SetMass(
           new int[,]
           {
                { 0,0,1,0,0 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 }
           },
           "rock"
           );
        Levels[lvl].SetCells();

        ////////////////////////////////////////////////////////////////////////////
        //уровень 2
        lvl = 2;
        Levels[lvl] = CreateLevel(2, 7, 7, 2000000, 1000, 3, 0);

        Levels[lvl].PassedWithCrystal = true;
        Levels[lvl].NeedColor = (CellInternalObject.InternalColor)1;
        Levels[lvl].NeedCrystal = 25;

        Levels[2].SetMass(
            new int[,] //exist
            {
                { 0,1,0,0,0,1,0 },
                { 1,1,1,0,1,1,1 },
                { 1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1 },
                { 1,1,1,0,1,1,1 }
            },
            "exist"
            );
        Levels[lvl].SetMass(
            new int[,] //color
            {
                { 0,2,0,0,0,1,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,1,0,0,0,2,0 },
                { 1,2,1,0,2,1,2 }
            },
            "color"
            );
        Levels[lvl].SetMass(
            new int[,] //type
            {
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,6,0,0,0,6,0 },
                { 1,1,1,0,1,1,1 }
            },
            "type"
            );
        Levels[lvl].SetMass(
            new int[,] //rock
            {
                { 0,1,0,0,0,1,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0 }
            },
            "rock"
            );
        Levels[lvl].SetCells();

        ////////////////////////////////////////////////////////////////////////////
        //уровень 3
        lvl = 3;
        Levels[lvl] = CreateLevel(3, 8, 8, 100000, 99, 3, 0);

        Levels[lvl].PassedWithPanel = true;

        Levels[lvl].SetMass(
            new int[,] //exist
            {
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,0,0,1,1,1 },
                { 1,1,1,0,0,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
            },
            "exist"
            );
        Levels[3].SetMass(
            new int[,] //color
            {
                { 2,1,2,1,2,1,2,1 },
                { 1,0,0,0,0,0,0,2 },
                { 2,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,2 },
                { 2,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,2 },
                { 2,1,0,0,0,0,2,1 },
                { 1,2,1,2,1,2,1,2 },
            },
            "color"
            );
        Levels[lvl].SetMass(
            new int[,] //type
            
            {
                { 4,1,1,1,1,1,1,3 },
                { 1,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,1 },
                { 1,1,0,0,0,0,1,1 },
                { 1,1,1,0,0,1,1,1 },
                { 3,1,1,1,1,1,1,4 },
            },
            "type"
            );
        Levels[lvl].SetMass(
             new int[,] //panel
             {
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 1,0,0,0,0,0,0,1 },
            },
             "panel"
             );
        Levels[lvl].SetMass(
            new int[,] //rock
            {
                { 0,1,1,1,1,1,1,0 },
                { 1,1,0,0,0,0,1,1 },
                { 1,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,1 },
                { 1,0,0,0,0,0,0,1 },
                { 0,1,0,0,0,0,1,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,1,1,1,1,1,1,0 },
            },
            "box"
            );
        Levels[lvl].SetCells();

        //////////////////////////////////////////////////////////////////////////////
        //уровень 4
        lvl = 4;
        Levels[lvl] = CreateLevel(3, 8, 8, 100000, 99, 3, 0);

        Levels[lvl].PassedWithPanel = true;

        Levels[lvl].SetMass(
            new int[,] //exist
            {
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
            },
            "exist"
            );
        Levels[lvl].SetMass(
            new int[,] //color
            {
                { 2,4,5,4,4,5,4,1 },
                { 4,1,4,5,5,4,1,4 },
                { 4,4,1,4,4,1,4,4 },
                { 5,5,4,1,1,4,5,5 },
                { 4,4,1,4,4,1,4,4 },
                { 4,1,4,1,1,4,1,4 },
                { 2,1,1,1,1,1,2,1 },
                { 1,2,1,2,1,2,1,2 },
            },
            "color"
            );
        Levels[lvl].SetMass(
            new int[,] //type
            
            {
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,1,1,1,1,1 },
                { 1,1,1,2,1,1,1,1 },
            },
            "type"
            );
        Levels[lvl].SetMass(
             new int[,] //panel
             {
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
                { 1,0,0,0,0,0,0,1 },
            },
             "panel"
             );
        Levels[lvl].SetMass(
            new int[,] //rock
            {
                { 0,1,1,1,1,1,1,0 },
                { 1,0,1,1,1,1,0,1 },
                { 1,1,0,1,1,0,1,1 },
                { 1,1,1,0,0,1,1,1 },
                { 1,1,0,1,1,0,1,1 },
                { 1,0,1,0,0,1,0,1 },
                { 0,0,0,0,0,0,0,0 },
                { 0,0,0,0,0,0,0,0 },
            },
            "rock"
            );
        Levels[lvl].SetCells();

        //////////////////////////////////////////////////////////////////////////////
        //уровень 5
        lvl = 5;
        Levels[lvl] = CreateLevel(3, 2, 3, 100000, 99, 3, 0);

        Levels[lvl].PassedWithPanel = true;

        Levels[lvl].SetMass(
            new int[,] //exist
            {
                { 1,1,1 },
                { 1,1,1 },
            },
            "exist"
            );
        Levels[lvl].SetMass(
            new int[,] //color
            {
                { 3,2,3 },
                { 1,3,3 },
            },
            "color"
            );
        Levels[lvl].SetMass(
            new int[,] //type
            
            {
                { 1,1,1},
                { 1,1,1 },
            },
            "type"
            );
        Levels[lvl].SetMass(
             new int[,] //panel
             {
                { 0,0,0},
                { 0,0,0},
            },
             "panel"
             );
        Levels[lvl].SetMass(
            new int[,] //rock
            {
                { 0,0,0 },
                { 0,0,0},
            },
            "rock"
            );
        Levels[lvl].SetCells();
    }


}

/*

//уровень 1
        Levels[1] = CreateLevel(1, 6, 5, 2000000, 50, 4, 0);

        Levels[1].PassedWithCrystal = true;
        Levels[1].NeedColor = (CellInternalObject.InternalColor)0;
        Levels[1].NeedCrystal = 20;
        Debug.Log((int)Levels[1].NeedColor);
        Levels[1].SetMass(
        new int[,] //exist
            {
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 }
            },
            "exist"
            );
        Levels[1].SetMass(
            new int[,] //color
            {
                { 3,0,3,0,1 },
                { 0,3,1,1,0 },
                { 0,3,3,1,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 }
            },
            "color"
            );
        Levels[1].SetMass(
            new int[,] //type
            {
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 }
            },
            "type"
            );
        Levels[1].SetMass(
           new int[,]
           {
                { 0,0,1,0,0 },
                { 1,1,1,1,1 },
                { 1,1,1,1,1 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 },
                { 0,0,0,0,0 }
           },
           "rock"
           );
        Levels[1].SetCells();






 */